Repository: 84000/data-translation-memory
Catalog: toh425-v1.tmx
Source language: bo
Languages: en

source: དཔལ་རྡོ་རྗེ་མཁའ་འགྲོ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the Glorious Vajraḍākinī!

source: དཔལ་ལྡན་རྡོ་རྗེ་མཁའ་འགྲོ་མ། །མཁའ་འགྲོ་མ་ཡི་འཁོར་ལོ་བསྒྱུར། །ཡེ་ཤེས་ལྔ་དང་སྐུ་གསུམ་ཉིད། །འགྲོ་བ་སྐྱོབ་ལ་ཕྱག་འཚལ་ལོ། །
en: I pay homage to the protector of beings, Glorious Vajraḍākinī, Universal sovereign of the ḍākinīs, the very essence of the five wisdoms and three bodies.

source: ཇི་སྐད་རྡོ་རྗེ་མཁའ་འགྲོ་མ། །ཀུན་ཏུ་རྟོག་པའི་འཆིང་གཅོད་ཅིང་། །འཇིག་རྟེན་བྱ་བར་རབ་འཇུག་པ། །དེ་སྙེད་རྣམས་ལ་ཕྱག་འཚལ་ལོ། །
en: I pay homage to all the vajraḍākinīs Who cut the bonds of conceptual thought and descend to act in the world.

source: དེ་ནས་དེ་ལས་རྡོ་རྗེ་མཁའ་འགྲོ་མ་གསང་བའི་དབང་ཕྱུག་མ་རྣམས་ཀྱི་མཆོག་ཏུ་གསང་བ་ཞེས་བྱ་བའི་རྒྱུད་བཤད་པར་བྱ་སྟེ།
en: Now, following that, I will explain the tantra called The Supreme Secret of the Secret Goddesses, the Vajraḍākinīs

source: གང་ཞིག་གིས་ནི་ཀུན་ཁྱབ་པ། །རྒྱུ་དང་མི་རྒྱུ་ཚངས་སྒོ་ང་། །
en: She pervades the entire Egg of Brahmā, the animate and inanimate.

source: ལྷ་མོ་ཐམས་ཅད་སྐྱེད་བྱེད་
en: She is the source of all goddesses

source: ཚངས་ལ་སོགས་པའི་བདག་ཉིད་ཆེ། །
en: rules over Brahmā and the rest.

source: དེ་རྣམས་ཀྱི་ནི་གསང་ཆེན་འདི། །
en: She is their great secret,

source: སྒྱུ་འཕྲུལ་ཆེན་མོ་དབང་ཕྱུག་ཆེ། །
en: the great Queen Mahāmāyā.

source: སྒྱུ་འཕྲུལ་ཆེན་མོ་དྲག་ཆེན་མོ། །འབྱུང་བ་ཡང་དག་སྡུད་མཛད་མ། །
en: She is the great illusion, intensely fierce, who destroys all that exists.

source: གང་གིས་འདི་ཀུན་ལ་ཁྱབ་པ། །
en: She pervades all of this:

source: རྒྱུ་དང་མི་རྒྱུའི་འཇིག་རྟེན་གསུམ། །
en: the animate and inanimate, the three worlds.

source: དེས་ནི་དེ་ནས་འདི་བསྡུས་ནས། །འཇིག་རྟེན་གསུམ་པོ་ཡང་སྤྲོའོ། །
en: Time after time she gathers in and again emanates the triple world.

source: གསང་བ་པ་རྣམས་འདི་ཡི་ནི། །སྒྱུ་མའི་བདག་ཉིད་ཅེས་རྣམ་གྲགས། །
en: This mother of the guhyakas is celebrated as the essence of illusion.

source: འཇིག་རྟེན་གསུམ་སྒྲུབ་རིག་མ་སྟེ། །འདོད་པ་ཐམས་ཅད་རབ་སྟེར་བ། །
en: She is the knowledge that perfects the three worlds and fulfills all desires.

source: གང་ཞིག་རྣམ་པར་ཤེས་ཙམ་གྱིས། །སྒྲུབ་པའི་དབང་ཕྱུག་རིག་པ་ཉིད། །
en: Through the mere thought of the queen of the accomplished, knowledge itself,

source: ལྷ་དང་ནོར་བདག་དྲི་ཟ་དང་། །གནོད་སྦྱིན་ལྷ་མིན་མི་དང་བཅས། །
en: The devas, dānavas, gandharvas, yakṣas, āsuras, and humans,

source: རིག་པ་འཛིན་དང་གང་ཡང་རུང་། །མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེ། །སྲིན་པོ་དང་ནི་ཤ་ཟ་རྣམས། །
en: The vidyādharas, the kinnaras, and mahodaras, The rākṣasas and piśācas

source: སྒྲུབ་པོ་རྣམས་ལ་འགྲུབ་པར་འགྱུར། །
en: —all are mastered for practitioners.

source: དབང་དུ་འདུ་འགྱུར་འབྱུང་པོ་རྣམས། །
en: All creatures are subdued:

source: ཆུ་ལས་སྐྱེས་དང་ཐང་ལས་སྐྱེས། །
en: those born in the water and on land.

source: ཆོས་རྣམས་རང་བཞིན་འོད་གསལ་བ། །
en: Phenomena are naturally luminous;

source: གདོད་ནས་དག་ཅིང་རྙོག་པ་མེད།
en: they are primordially pure and without stain.

source: ཐབས་བརྗོད་པ་ཡིས་དེ་ལས་ནི། །རང་བྱུང་ཡེ་ཤེས་ལྔ་ལྡན་འགྱུར། །
en: The methods of those possessing the self-arisen five wisdoms are to be praised;

source: རྣལ་འབྱོར་མ་རྣམས་སྦྱོར་བའི་མ། །
en: These are the yoginīs, the mother of yoga,

source: ཁམས་གསུམ་པོ་ནི་མ་ལུས་ཀུན། །
en: and the entirety of the three worlds.

source: མ་ལུས་ལུས་པ་མེད་གྲུབ་ཅིང་། །སྒྱུ་མ་ཀུན་གྱིས་རྣམ་རོལ་པའོ། །
en: The entire play of illusion is accomplished without exclusion or remainder.

source: སངས་རྒྱས་ཀུན་ལས་ཕྲོགས་ནས་སུ། །ལྷ་མཆོག་ལྷ་སྐྱེས་བུ་མོ་སྐྱོད། །
en: Abducted from the buddhas, the maidens of the highest gods are enjoyed.

source: རྣལ་འབྱོར་དབང་ཕྱུག་བྱེད་རིག་པ། །དེ་བཞིན་དུ་ནི་མིག་འཕྲུལ་བྱེད། །
en: The yogī has knowledge, masters yoga, and weaves Indra’s Web.

source: རྨོངས་པ་དང་ནི་རེངས་པ་དང་། །བསྐྲད་དང་གསད་པ་ལ་སོགས་པ། །དབང་དང་དགུག་པ་ལ་སོགས་དང་། །ནམ་མཁར་འགྲོ་བ་ཉིད་ཀྱང་ངོ་། །
en: He beguiles and paralyzes, slays, dissuades, and more. He tames, magnetizes, and so forth; he flies through the sky.

source: གཞན་གྱི་གྲོང་སོགས་བྱ་བ་དང་། །མི་སྣང་བ་དང་གང་ཡང་རུང་། །ཞེ་འགྲས་པ་དང་རྨུགས་པ་དང་། །དེ་བཞིན་ས་འོག་འགྲོ་བའོ། །
en: He enters the citadel of another, is invisible, and so on. He causes hostility, renders mute, and moves under the earth;

source: རིག་འཛིན་འཁོར་ལོས་སྒྱུར་ཉིད་འགྱུར། །འཆི་བ་མེད་ཅིང་རྒས་པ་མེད། །
en: Becomes the universal sovereign of vidyādharas, does not age, and is deathless.

source: རྣལ་འབྱོར་སྒྱུ་མའི་རིག་པ་འདི། །འདི་ཡིས་ན་བ་མེད་པར་འགྱུར། །སྔགས་ཀྱི་ཡི་གེའི་གཟུགས་ཀྱིས་སུ། །རྣལ་འབྱོར་བས་ནི་རྣམ་རོལ་བྱེད། །
en: One with knowledge of yogic illusion is likewise free from disease— Yogīs revel in the form of the mantra’s syllables.

source: བཀླགས་པ་དང་ནི་བསམས་པ་ཡིས། །བསྒོམ་པ་དང་ནི་ཏིང་འཛིན་རྣམས། །
en: Through recitation and contemplation, meditation and absorption,

source: བཀླགས་པས་བྱེད་པའི་རིག་པ་སྟེ། །རིག་པའི་དངོས་གྲུབ་བྱེད་པར་འགྱུར། །
en: The vidyā created through recitation brings about the accomplishment of knowledge.

source: བརྟུལ་ཞུགས་མེད་ཅིང་དཀའ་ཐུབ་མེད། །དཀའ་སྤྱོད་སྨྱུང་བ་སྡོམ་མེད་པར།
en: Without discipline or austerities, without hardship, fasting, or vows,

source: དགའ་དང་བདེ་བས་འགྲུབ། །
en: Bliss and Joy bring accomplishment

source: རྟག་ཏུ་ཤེས་རབ་ཐབས་སོགས་ཀྱིས། །
en: through constancy in knowledge and method.

source: ལྟེ་བའི་དབུས་ནས་དཔའ་བོ་སྟེ། །
en: The Virile One stands in the center of the navel,

source: གེ་སར་གསང་བའི་སྤྱོད་ཡུལ་ལ། །
en: in the hidden space of the blossom;

source: སེམས་དང་སེམས་མེད་སེམས་ཀྱི་གཟུགས། །ཡེ་ཤེས་ཤེས་བྱའི་རང་བཞིན་བདག །
en: He is mind, the absence of mind, and mental form—the nature of knowledge and what can be known.

source: དེ་ནི་བདག་གིས་བཤད་བྱ་སྟེ། །ཟབ་མོ་སངས་རྒྱས་བསྟན་པའོ
en: I will now describe him—this is the profound instruction of the Buddha:

source: ཨཱ་ལི་ཀཱ་ལི་མཉམ་བྱས་ཏེ། །རི་མོ་དེ་ལ་སྦྱར་བར་བྱ། །
en: A chain equal to that of the āli kāli is coiled there.

source: རི་མོ་སྟེང་དུ་འབར་བ་མཐར། །འོག་ཏུ་འབབ་པར་བྱེད་པའོ
en: The upper chain ignites and is made to flow downward,

source: ཁུ་བའི་ཚུལ་གྱིས་འབབ་པ་སྟེ། །བདུད་རྩིའི་ཐིགས་པའི་གཟུགས་ལས་སོ། །
en: A drop of nectar flowing in the form of semen.

source: གང་གང་དབང་པོའི་ལམ་ནས་ནི། །དེ་དེའི་རང་བཞིན་སྐྱེ་བར་འགྱུར། །
en: Whatever comes on the path of the senses is naturally just that.

source: སངས་རྒྱས་ཀུན་གྱི་རང་བཞིན་འབབ། །
en: all becomes the nature of the Buddha.

source: མཆོག་ཏུ་ཕན་པའི་རྣལ་འབྱོར་གྱིས། །
en: Through the practice of supreme benefit

source: དམ་ཚིག་ཆེན་པོའི་དངོས་གྲུབ་དང་། །རིལ་བུ་ཆེན་པོའི་བསྒྲུབ་པ
en: The spiritual attainment of the great commitment is the perfection of the great pill.

source: སྒྱུ་འཕྲུལ་ཆེན་པོའི་རབ་སྦྱོར་བའི། །སྡོམ་པའི་སྦྱོར་བ་བྱེད་པར་འགྱུར། །
en: In the embrace of Mahāmāyā you should practice yogic union.

source: མཆོད་པ་ལྔ་དང་ཡང་དག་ལྡན། །འདོད་པའི་ཡོན་ཏན་ལྔ་དང་བཅས། །
en: Endowed with the five offerings together with the five objects of desire,

source: སྒྲུབ་པའི་དབང་པོ་ཤེས་བྱ་བ། །དངོས་གྲུབ་ཤིན་ཏུ་རྟག་པའོ། །
en: The power of accomplishment will be known and spiritual attainment made permanent.

source: གང་ཞིག་ཤེས་པའི་དངོས་གྲུབ་ཀྱིས། །ལྷ་ཡི་གནས་སུ་མྱུར་བར་འགྱུར། །དེ་ནི་བདག་གིས་བཤད་བྱ་སྟེ། །
en: I will explain this spiritual attainment of wisdom, By which the state of a god is swiftly attained

source: ལྷ་མོ་བདེན་པར་ང་སྨྲའོ། །
en: —Goddess, I speak truthfully!

source: སྒྱུ་འཕྲུལ་ཆེན་མོ་ཁྱོད་ལ་ངས། །འཇིག་རྟེན་གསུམ་འགྲུབ་དེ་བཤད་བྱ།
en: To you, Mahāmāyā, I will explain the accomplishment of the three worlds,

source: རྣལ་འབྱོར་ཆེན་མོ་རྣམས་ཀྱི་ནི། །བཟང་པོའི་ཡི་གེའི་ཕྲང་བ་རྣམས། །
en: The garland of syllables of the most excellent among the great yoginīs.

source: གང་ཞིག་བསམས་པ་ཙམ་གྱིས་ནི། །རྒྱུ་དང་ནི་རྒྱུ་འགྲུབ་འགྱུར་བའོ། །འདོད་པས་ཀུན་ལ་ཉེར་སྤྱོད་པ། །ཇི་ལྟར་འདོད་བཞིན་བསྟེན་བྱས་ན། །རྣལ་འབྱོར་པ་ཆེན་
en: The great yogī who masters the animate and inanimate with thought alone Is constantly offered desirable things and served according to his pleasure.

source: རྟག་རོལ་ཏེ། །རྡོ་རྗེ་རྣལ་འབྱོར་རྣམས་འགྲུབ། །
en: He is always at play and accomplishes the vajra yoginīs.

source: རྣམ་པ་སྣ་ཚོགས་གཟུགས་སུ་ནི། །རྣལ་འབྱོར་བདག་ཉིད་སྟོན་པར་བྱེད། །
en: In a variety of forms the essential practice is revealed.

source: དེ་བཞིན་གཤེགས་པ་ཀུན་གྱི་དཔལ། །དངོས་གྲུབ་ཆེན་པོ་སྟེར་བར་འགྱུར། །
en: The great attainment, the splendor of the tathāgatas, is granted;

source: བཅུད་ལེན་རྣམ་པ་སྣ་ཚོགས་ཀྱིས། །
en: Through extracting various essences

source: རྟག་ཏུ་སེམས་ཅན་དོན་བྱེད་པའོ། །
en: constantly benefits beings.

source: ཁུ་བ་དགུག་དང་ཆང་དང་ནི། །གོང་བུ་ཆེན་པོ་དགུག་པ་ཉིད། །
en: With the collected semen, liquor, and extracted large pill,

source: ཤ་ཆེན་པོ་ནི་བཀུག་ནས་སུ། །རྣལ་འབྱོར་མ་དང་ལྷན་ཅིག་སྤྱོད། །
en: He mixes in the great flesh and unites with the yoginī.

source: ཚེ་རིང་བརྩོན་འགྲུས་ཆེན་པོ་དང་། །གཟི་བརྗིད་ཆེ་ཞིང་སྟོབས་ཆེན་འགྱུར། །
en: He gains long life, great virility, great splendor, and becomes exceedingly powerful;

source: ལྷ་ཡི་མིག་དང་རྫུ་འཕྲུལ་ལྡན། །ཉིན་རེ་ཟླ་བ་འཐུང་བའོ། །
en: He possesses divine sight, magical ability, and drinks the moon day after day;

source: དེ་ཡི་ཚེ་ནི་འཕེལ་འགྱུར་ཏེ། །བསྐལ་པ་ཆེན་པོའི་བར་དུ་གནས། །
en: He becomes long-lived so that he lives for a great age;

source: བལྟ་བས་མི་ངོམས་ལུས་དང་ནི། །ཆོ་འཕྲུལ་དག་ནི་སྟོན་པར་བྱེད། །
en: He manifests an alluring form and conjures miracles;

source: ཡིད་ལ་བསམས་མ་ཐག་ཏུ་ནི། །རང་གི་གཟུགས་ནི་ཡོངས་བརྗེས་ཤིང་། །
en: With merely a thought his appearance is transformed—

source: རིག་མའི་དབང་ཕྱུག་རྫུ་འཕྲུལ་ཆེ། །
en: The queen of vidyās, the great enchantress,

source: བཀླགས་པས་འགྲུབ་པའི་དོན་ཡོད་པ། །
en: is unfailingly accomplished through recitation.

source: རིག་པ་འཇིག་རྟེན་གསུམ་པོ་ན། །ང་ཡི་རིག་དང་མཉམ་པ་མེད། །
en: Vidyā! In the three worlds there is nothing equal to my knowledge.

source: རྒྱུད་རྣམས་ཀུན་གྱི་ལུང་འདི་ནི། །
en: This transmission of all tantras

source: མཛེས་མ་ཁྱོད་ལ་བཤད་པ་ཡིན། །
en: has been explained to you, Magnificent One!

source: རྣལ་འབྱོར་མའི་དབང་ཕྱུག་མའི་རིག་མ་ཆེན་མོ་ལས་དངོས་གྲུབ་ཀྱི་མཚན་མ་བསྟན་པ་སྟེ་ལེའུ་དང་པོའོ། །
en: This completes the first instruction on the signs of spiritual attainment of “ The Great Vidyā, Queen of the Yoginīs

source: དེ་ནས་དེ་ལས་རྣལ་འབྱོར་མའི་དབང་ཕྱུག་ཆེན་མོ་རྣམས་ཀྱི་སྦྱོར་བའི་དངོས་གྲུབ་ཀྱི་འབྲས་བུ་རབ་ཏུ་སྟེར་བའི་གསང་བའི་ཡི་གེ་བཟང་པོ་བཤད་པར་བྱ་སྟེ།
en: Now, following that, I will explain the sublime secret syllable that bestows the result of the spiritual attainment for the practice of the great queens of yoga.

source: གང་ཞིག་བསམས་པ་ཙམ་གྱིས་ནི། །རྣལ་འབྱོར་མ་མཆོག་སྟེར་འགྱུར་བ། །
en: Merely visualizing her, the yoginī grants the best of things.

source: དང་པོའི་ཡི་གེའི་སྦྱོར་བ་ཡིས། །རྟག་ཏུ་དགུགས་ནི་གཏང་བར་བྱ། །
en: Apply the first syllable and sustain the upward breath.

source: བརྒྱད་པའི་མཐའ་དང་ཡང་དག་ལྡན། །
en: Taking that which comes at the end of the eight

source: ཨུ་དང་ཐིག་ལེར་བཅས་པ་ཡིས། །
en: together with ū and the bindu,

source: རྣལ་འབྱོར་པ་ཡི་དབུགས་རྔུབ་བྱེད། །
en: The yogī moves the downward breath,

source: དངོས་དང་དངོས་མེད་རྣམ་སྤངས་པའོ།
en: abandoning the real and unreal.

source: ཕྲེང་བ་སྔགས་དང་གཟུང་བ་དང་། །སྦྱིན་སྲེག་གི་ནི་ལས་རྣམས་ཀྱང་། །གཅིག་ནས་གཅིག་ཏུ་ལྡོག་པར་འགྱུར། །
en: the activities of the garland mantra, Of retention, and of fire offerings are all omitted.

source: དེ་ལ་བརྟུལ་ཞུགས་མ་བཤད་དེ། །
en: The observances are not explained:

source: སྔགས་དང་དབྱིབས་དང་ཆོས་བདག་ཉིད། །སྦྱོར་བ་རྣམ་གསུམ་ཞེས་བྱ་སྟེ། །
en: The threefold practice is said to be essentially mantra, appearance, and reality.

source: ཡེ་ཤེས་རྣམ་པ་གསུམ་གྱིས་ནི། །
en: Through three aspects of wisdom

source: སྲིད་པའི་ཉེས་པས་གོས་མི་འགྱུར། །
en: he will not be stained by the faults of existence.

source: དེ་ལྟར་རྒྱུན་དུ་རྣལ་འབྱོར་པ། །རྟག་ཏུ་གོམས་པ་ཉིད་ཀྱིས་ནི། །
en: The yogī who constantly meditates on this without interruption

source: རྡོ་རྗེ་སེམས་དཔའ་དང་མཉམ་པའང་། །
en: Is equal to Vajrasattva and

source: ཟླ་བ་གཅིག་གིས་དེ་འགྲུབ་འགྱུར། །
en: gains accomplishment in a single month.

source: དབང་པོའི་མདོག་དང་ཡང་དག་ལྡན། །དང་པོའི་ཡི་གེ་བསྒོམ་བྱ་སྟེ། །
en: Meditate upon the first syllable which is the color of Indra.

source: རང་གི་རིག་པ་རབ་སྦྱར་ན། །
en: Merged fully with one’s own awareness

source: དེས་འདི་མོད་ལ་འགུགས་པར་འགྱུར། །
en: it is summoned in an instant.

source: ཡི་གེ་གཉིས་པ་དང་ལྡན་པ། །བསམ་ཞིང་རྣམ་པར་བསྒོམ་བྱས་ན། །
en: The one possessing the second syllable is imagined and cultivated.

source: ས་གསུམ་པོ་ནི་མ་ལུས་པ། །དེ་དག་ཐམས་ཅད་དབང་དུ་འགྱུར། །
en: One gains power over everything within the whole of the three worlds.

source: ཚངས་དང་ཁྱབ་འཇུག་དབང་པོ་དང་། །དེ་བཞིན་དབང་པོ་འདོད་དབང་ཕྱུག །
en: Brahmā, and lord Viṣṇu, so too Indra and the Lord of Desire—

source: ཡེ་ཤེས་ཡི་གེས་བསྐུལ་བྱས་ན། །
en: Invoked with the wisdom syllable,

source: ཡི་གེ་ཨ་དང་ཡང་དག་ལྡན། །
en: Endowed with the syllable ā

source: དེ་དག་ཆུང་མར་བཅས་ཏེ་འགུགས། །
en: they are summoned along with their wives.

source: སྐུ་གསུང་ཐུགས་ལ་ལེགས་གནས་པ། །
en: settled in awakened body, speech, and mind,

source: སྦྱོར་བ་རྣམ་གསུམ་བསྒོམ་བྱས་ན། །གོང་བུ་འགུགས་པའི་མཆོག་ཡིན་ནོ། །
en: Perform the threefold union—this is the supreme extraction of the pill.

source: ཡི་གེ་ཁེ་དང་ཡང་དག་ལྡན། །
en: Possessing the syllable khe

source: སྐུ་མདོག་དམར་པོ་ཞལ་བཞི་པ། །
en: is the four-faced one with a red body.

source: ལག་ན་ཐོད་པ་ཆགས་པའི་བདག །ཁུ་བ་འགུགས་པའི་མཆོག་ཡིན་ནོ། །
en: Skull cup in hand he is passion itself—this is the supreme extraction of semen.

source: ཡི་གེ་རྩི་དང་ལྡན་པ་ཡིས། །ཁ་དོག་སེར་པོ་ཀུན་ཏུ་འོད། །
en: Possessing the syllable ci is one yellow in color who shines brightly,

source: རྟ་ཡི་ཞལ་གྱི་ཚུལ་བྱས་ན། །
en: With the form of a horse’s face

source: ཡི་གེར་དང་ཡང་དག་ལྡན།
en: The one possessing the syllable ra

source: ཆང་འགུགས་པ་ཡི་དམ་པ་ཡིན། །
en: —engaging him is the supreme extraction of the liquor.

source: ཁ་དོག་དམར་པོ་འོད་ཆེན་པོ། །
en: is red in color and exceedingly bright,

source: ཕྱག་བཞི་པ་དང་ཞལ་བཞི་པ། །
en: Has four arms and four faces,

source: ཅེ་སྤྱང་ཚུལ་དུ་ལེགས་གནས་པ། །
en: appears in the form of a jackal.

source: ཁྲོ་བའི་སེམས་ཀྱིས་བསྒོམ་བྱས་ན། །
en: Cultivating this wrathful mind

source: ཁྲག་འགུགས་པ་ཡི་དམ་པའོ། །
en: is the supreme extraction of blood.

source: ཡི་གེ་དྲུག་དང་ཡང་དག་ལྡན། །
en: Endowed with the six syllables,

source: གནས་དྲུག་ཏུ་ནི་ངེས་སྦྱར་བྱ། །
en: they are fixed in the six places.

source: རྣལ་འབྱོར་མཁའ་འགྲོ་མ་ཡི་ཚོགས། །རྡོ་རྗེ་རྣལ་འབྱོར་མ་རྣམས་འགྲུབ། །
en: The practice, the host of ḍākinīs, and the vajra yoginīs are accomplished,

source: སེང་གེ་རྣལ་འབྱོར་ཕྱག་རྒྱ་ཡི། །རྣལ་འབྱོར་པ་ཡིས་བཅིང་བར་བྱ།
en: Yogīs take the posture of a sporting lion;

source: མིག་གཉིས་དང་ནི་རྣ་བ་དང་། །དེ་བཞིན་སྣ་དང་ཡིད་ཉིད་དག །
en: The two eyes, the ears, and so too the nose and the mind.

source: སྲོག་དང་རྩོལ་བ་བསྡམས་ནས་སུ། །བསྒོམས་ན་སྐད་ཅིག་དེ་ལ་འབར། །
en: While meditating with the movement of breath controlled, it blazes in an instant

source: འོག་མིན་སྲིད་པའི་མཐར་ཐུག་པ
en: Akaniṣṭha, the summit of existence,

source: རྒྱུ་དང་མི་རྒྱུའི་འཇིག་རྟེན་བདུན། །
en: the seven worlds of the animate and inanimate.

source: ཐམས་ཅད་ཀྱིས་ནི་དེ་བསྒོམས་ཀྱང་། །དེ་ནི་རྟོག་པ་མ་ཡིན་ནོ། །
en: All meditate upon it, but they don’t realize it.

source: གལ་ཏེ་ཐམས་ཅད་རབ་རྟོགས་ན། །
en: If everyone realized it,

source: འགྲོ་བའི་རོལ་པ་རྣམ་པར་འཇིག །
en: the manifestations of beings would utterly collapse.

source: དེ་ཕྱིར་ཡེ་ཤེས་འདི་གསང་ཞིང་། །མི་གསལ་ཡི་གེ་མེད་པའོ། །
en: Therefore this wisdom is secret, obscure, and unwritten.

source: གང་ཕྱིར་སངས་རྒྱས་རྣམས་ཀྱིས་མཁྱེན། །
en: Because the awakened ones know,

source: རྣལ་འབྱོར་གཉིད་དང་ཡང་དག་ལྡན། །གོང་བུར་སོང་བའི་ཡིད་དེ་ཡིས། །
en: they who are immersed in yogic sleep, They concentrate upon the pill

source: གཟུགས་གཅིག་ཏུ་ནི་སྒོམ་པར་བྱེད། །
en: meditate on the singular nature of forms.

source: སྒོ་དགུ་ལས་ནི་གང་བྱུང་བ། །རྫས་ཀྱི་བདག་ཉིད་རྣམ་བསྒོམས་ལ། །
en: They meditate on the essence of the substances arisen from the nine doors,

source: རང་བཞིན་མེད་པའི་བློ་ལྡན་པའི། །རྣམ་པར་མི་རྟོག་པ་ཡིས་བཟའ། །
en: consume them with a mind free of concepts and devoid of intrinsic nature.

source: མཐེ་བོང་དང་ནི་སྲིན་ལག་གིས། །
en: With the thumb and ring finger,

source: ཁ་རུ་ཡིད་བཞིན་ནོར་བུ་ནི། །
en: place the wish-granting jewel in the mouth,

source: བདུད་རྩིའི་རང་བཞིན་ལས་བྱུང་བའི། །རྟག་པའི་དངོས་གྲུབ་ཐོབ་པར་འགྱུར། །
en: attain the everlasting spiritual attainment arisen from the nature of the nectar.

source: རྣལ་འབྱོར་མའི་དབང་ཕྱུག་མའི་རིག་པ་ཆེན་མོ་ལས་སྦྱོར་བ་གཏན་ལ་དབབ་པའི་ལེའུ་སྟེ་གཉིས་པའོ།། །།
en: This completes the second instruction on the practice of “ The Great Vidyā, Queen of the Yoginīs

source: དེ་ནས་ཡང་དག་བཤད་བྱ་བ། །དམ་ཚིག་སྒྲུབ་པའི་དམ་པ་སྟེ། །
en: Now comes a thorough explanation of the supreme accomplishment of the samaya:

source: རྫས་གཞན་ཚོགས་ནི་བཟའ་བྱ་བ། །ཐམས་ཅད་མཁྱེན་པའི་འབྲས་སྟེར་བའོ། །
en: The ingestion of the other gathered substances that bestow the result of omniscience.

source: འབྱུང་པོའི་མི་རྣམས་འགྲུབ་འགྱུར་བ། །
en: the mothers of the spirits are accomplished:

source: གང་ཞིག་ཟོས་པ་ཙམ་གྱིས་ནི། །
en: By their mere consumption

source: ཆེན་པོར་ཡང་དག་ལྡན་པ་ནི།
en: Mixed with the great one

source: བརྟན་པ་དང་ནི་མྱུར་འགྲོ་ཉིད། །དེ་བཞིན་དུ་ནི་བ་ལང་ཁྱི། །
en: Elephant and horse, and so too cow and dog.

source: དེ་བཞིན་ཡེ་ཤེས་བདུད་རྩི་ལྔ། །
en: and also the five wisdom nectars,

source: ཚེས་གྲངས་བཅུ་བཞི་བརྒྱད་ལ་ནི། །
en: From the fourteenth to the eighth

source: ལྷན་ཅིག་བསྒོས་ཏེ་སྦྱར་བྱས་ནས། །
en: they are combined and mingled together.

source: ཉི་མ་བདུན་དུ་ཅེ་སྤྱང་གི། །དབུས་སུ་གཞག་ལ་དེ་ནས་བཏོན། །
en: Left inside a jackal for seven days, remove them.

source: ལྔ་པོ་དག་ལས་ཡུངས་ཀར་གྱི། །འབྲས་བུའི་ཚད་ཙམ་རིལ་བུ་བྱ། །
en: Roll the five into pellets the size of mustard seeds.

source: དེ་ནི་རྒྱུད་འདིར་གསུངས་མོད་ཀྱི། །ཚེས་བརྒྱད་དང་ནི་བཅུ་བཞིའི་བར་དག་ཏུ། །
en: Indeed this tantra teaches that from the eighth to the fourteenth

source: ཉི་མ་བདུན་དུ་ལྷན་ཅིག་མིན་བསྒོམ་སྟེ། །སྦྱར་ནས་ཅེ་སྤྱང་དབུས་སུ་ལགས་བཞག་ལ། །
en: Cultivate them individually for seven days, mix them, and place them in a jackal.

source: དེ་ལས་བཏོན་ཏེ་ལྔ་པོ་དག་ལས་ནི། །དངོས་གྲུབ་འབྲས་བུའི་ཚད་ཙམ་རིལ་བུ་བྱ། །
en: Take them out—from the five make pellets the size of the fruit of spiritual attainment.

source: འབྲས་བུ་ཆེན་པོ་རབ་ཏུ་རྟོགས་པས་ན། །དེ་ནི་རྒྱུད་འདིར་གསུངས་ཀྱི་ཀུན་ཏུ་སྦས། །
en: Because the great fruition is perfectly realized, it is taught in this tantra but fully concealed;

source: འབྲས་བུ་ཆེན་པོ་སངས་རྒྱས་ཀྱིས། །ཐམས་ཅད་དུ་ནི་སྦས་པའོ། །
en: The buddhas have concealed the great fruition in every instance.

source: དེ་ནས་སྒྲུབ་ཐབས་འབྱུང་བའོ
en: Next follows the method of practice:

source: ཡིད་ཀྱི་པདྨ་བསམ་བྱ་བ། །
en: visualize a mind lotus

source: ཁ་དོག་དམར་པོ་ཀུན་འོད་ལ། །
en: Glowing red in color

source: ལྷ་མོ་བཞི་དང་ཡང་དག་ལྡན། །
en: endowed with the four goddesses.

source: སངས་རྒྱས་གཟུགས་ཀྱིས་ཉེར་བརྒྱན་པའོ། །
en: It is adorned with the figure of the Buddha.

source: ཤར་དུ་ཨུཏྤལ་སྔོ་འོད་མདོག །ལྷོ་རུ་སེར་པོ་ལྟ་བུའོ། །ནུབ་ཏུ་དཀར་དང་དམར་བའི་འོད། །བྱང་དུ་མ་རྒད་འོད་ཡིན་ནོ། །
en: In the east he shines like a blue lotus, to the south he is yellow, To the west whitish red, and in the north he glows emerald.

source: འབར་བའི་ཕྲེང་བས་འཁྲིགས་པ་
en: Shrouded in a garland of flames,

source: ཞལ་བཞི་ཕྱག་བཞི་སྤྱན་གསུམ་མ་མཛེས། །
en: he is beautiful with three eyes, four faces, and four arms.

source: ཤར་ཕྱོགས་ཀྱི་ལྷ་མོ་ནི་སྤྱན་གསུམ་པ་ཕྱག་གཡོན་ན་ཁ་ཊྭཱྃ་ག་དང་དྲིལ་བུ། གཡས་ན་རྡོ་རྗེ་དང་། ཐོད་པ་བསྣམས་པ་བསམ་མོ། །
en: Imagine that the goddess in the east has three eyes and holds a khaṭvāṅga and bell in her left hands and a vajra and skull cup in her right hands.

source: ལྷོ་ཕྱོགས་ཀྱི་ལྷ་མོའི་ཕྱག་ན་མདུང་རྩེ་གསུམ་པ་དང་། རིན་པོ་ཆེ་དང་། བ་དན་དང་། ཅེ་སྤྱང་བསྣམས་པའོ། །
en: The goddess in the south wields a trident, a jewel, a banner, and a jackal.

source: ནུབ་ཕྱོགས་ཀྱི་ལྷ་མོའི་ཕྱག་ན་གཞུ་དང་། མདའ་དང་། སྣ་ཚོགས་པདྨ་དང་། ཐོད་པ་བསྣམས་པའོ། །
en: The goddess in the west holds a bow, an arrow, a multicolored lotus, and a skull cup.

source: བྱང་ཕྱོགས་ཀྱི་ལྷ་མོའི་ཕྱག་ན་རལ་གྲི་དང་། ཞགས་པ་དང་། རྔེའུ་ཆུང་དང་། ཐོད་པ་བསྣམས་པའོ། །
en: The goddess in the north wields a sword, a noose, a hand drum, and a skull cup.

source: སྐུ་གསུང་ཐུགས་ཀྱི་རྡོ་རྗེ་ནི། །དེ་ཡི་དབུས་སུ་བསམ་པར་བྱ། །
en: In its center visualize the vajra body, speech, and mind

source: ཐོད་པ་ཉིད་དང་ཁ་ཊྭཱྃ་ག། །དེ་བཞིན་གཞུ་དང་མདའ་ཉིད་དོ། །
en: Bearing a skull cup and khaṭvāṅga, and so too a bow and arrow.

source: དང་པོའི་སྔགས་དང་ཡང་དག་ལྡན། །བསྒོམས་ན་སྐད་ཅིག་དེ་ལ་འབར། །
en: Meditating on that which possesses the first mantra, it blazes for an instant.

source: དེ་ལྟར་རྣལ་འབྱོར་པས་བསྒྲུབས་ན། །རྫས་ཀྱི་དངོས་གྲུབ་རབ་ཏུ་སྟེར། །
en: Practicing like this, the yogī is granted the spiritual attainment of the substance.

source: རྣལ་འབྱོར་མ་ཡི་གྲུབ་སྦྱོར་བས། །འཕྲལ་དུ་ཡིད་ཆེས་ཡང་དག་འཇུག །
en: Through the accomplishment of the yoginī, confidence swiftly develops.

source: ཐམས་ཅད་ཀྱིས་ནི་མི་མཐོང་ཞིང་། །སྟོང་ཕྲག་གཅིག་ཏུ་སྣང་བར་འགྱུར། །
en: One can become entirely invisible and manifest a thousandfold at once.

source: སངས་རྒྱས་ཀུན་ལས་ཕྲོགས་པ་དང་། །ལྷ་ཡི་བུ་མོ་མཆོག་ལ་སྤྱོད། །
en: Plunder from the buddhas and enjoy sublime celestial girls.

source: གང་གཱའི་བྱེ་སྙེད་སངས་རྒྱས་རྣམས། །ཉིད་ཀྱི་རྡོ་རྗེའི་གནས་བཞུགས་པ། །ལག་ཏུ་སྐྱུ་རུ་ར་བཞག་བཞིན། །རྡོ་རྗེའི་མིག་གིས་མཐོང་བར་འགྱུར། །
en: With vajra eyes one will see, like an āmalaka fruit in the palm of one’s hand.

source: གང་གཱའི་བྱེ་སྙེད་ཞིང་དག་
en: Pure realms numerous as sand in the Gaṅgā,

source: སྐུ་གསུང་ཐུགས་ཀྱི་མཚན་ཉིད་དང་། །
en: the features of awakened body, speech, and mind,

source: དངོས་པོ་ཀུན་གྱི་བདག་ཉིད་གནས། །
en: The intrinsic condition of all objects

source: སེམས་ཀྱི་གར་ལས་བྱུང་བ་མཁྱེན། །
en: —know them to arise from the mind’s dance.

source: ཡི་གེ་གོ་བཟློག་སྦྱོར་བ་ཡིས། །
en: Apply the syllables in reverse

source: སྔགས་ནི་དེ་རུ་རྣམ་བསྒོམ་བྱ། །
en: meditate on the mantra.

source: རྡོ་རྗེ་ཆུ་དང་ཡང་དག་ལྡན། །རིལ་བུ་རེ་རེ་བཟའ་བར་བྱ། །
en: Ingest each one of the pills infused with the vajra drink.

source: ཡི་གེ་བརྒྱད་ཀྱི་མཐའ་ལྡན་པ། །
en: the last of the eight syllables

source: ཨཱུ་དང་ཐིག་ལེར་བཅས་པ་
en: together with the ū and bindu;

source: མཐའ་རུ་ཡང་དག་སྦྱར་བྱས་ལ། །སྔགས་ནི་ཀུན་དུ་བརྗོད་བྱ་སྟེ། །གུ་ཧྱ་བཀྵ་ཨ་བྷ་ཀྵེ་ཧཱུྃ་ཞེས་བྱའོ། །
en: Fix it firmly at the end and clearly pronounce the mantra: guhya bhakṣa abhakṣe hūṁ

source: རྣལ་འབྱོར་མ་ཀུན་སྦྱོར་བ་ཡིས། །
en: In perfect union with the yoginī

source: དང་པོའི་ཡི་གེ་ཡང་དག་ལྡན། །
en: take possession of the first syllable.

source: གལ་ཏེ་རྡོ་རྗེ་ཅན་གྱིས་གྲུབ་འདོད་ན། །
en: If desiring accomplishment through the vajra holder,

source: ལན་བདུན་མངོན་སྔགས་རྣལ་འབྱོར་པ་ཡིས་བཟའ། །
en: a yogī consumes the manifest mantra seven times.

source: ཡི་གེ་གསུམ་མཐའ་ཞེས་བྱ་སྟེ། །བརྒྱད་ཀྱི་མཐའ་མར་ལེགས་གནས་པ། །
en: The last of the three syllables sits clearly at the end of the eight.

source: ཨཱ་དང་ཐིག་ལེར་ཡང་དག་ལྡན། །
en: Endowed with the ū and bindu

source: ཡི་གེ་མཆོག་ཏུ་གྱུར་པའི་གནས། །
en: it remains as the supreme syllable.

source: ཡི་གེ་དང་པོ་སྦྱོར་བ་ཡིས། །ཧྲཱི་ཞེས་བྱ་བ་ཡང་དག་སྦྱར། །
en: The one linked to the first syllable is united with hrīḥ

source: ཡི་གེ་རྣམས་ཀྱི་མཐར་སྦྱོར་ལ། །ས་བོན་ལྔས་ནི་རབ་དགང་བྱ། །
en: Apply the last of the syllables and fix in place the five seeds.

source: ཡི་གེ་ཡིས་ནི་རྣམ་བསྒོམས་ཏེ། །པདྨ་རབ་ཏུ་རྒྱས་པར་བྱ། །
en: Meditate upon the syllable and cause the lotus to fully bloom.

source: ཅི་སྟེ་རྡོ་རྗེ་ཅན་འགྲུབ་འདོད།
en: For those who seek the accomplishment of a vajra holder,

source: དེ་ལྟའི་སྦྱོར་བ་ཀུན་ཤེས་བྱ། །
en: this union should be fully known.

source: དེ་ནས་འདིར་རྡོ་རྗེ་རྣལ་འབྱོར་མ་རྣམས་ཀྱིས་དགོངས་པ་དཔལ་རྡོ་རྗེའི་གྲས་སྲིད་པ་ཤིན་ཏུ་སྒྲུབ་པ་བླངས་པ། །
en: Then, the sublime vajra song which is the realization of the vajra yoginīs welcomes the one who thoroughly accomplishes existence:

source: ཀྱེ་གྲོགས་པོ་རྡོ་རྗེས་པདྨ་ཁ་འབྱེད་སད་མཛད་མ། །
en: “Hey, friend! The vajra makes the lotus swell and bloom.

source: ཨ་ལ་ལ་ཧོ། །
en: A la la la la ho!

source: བདེ་བ་ཆེན་པོ་གར་གྱིས་རབ་ཏུ་མཉེས་མཛོད་ཅིག །
en: You have been aroused by the dance of great bliss.

source: ཉི་མའི་དཀྱིལ་འཁོར་པདྨའི་ཁ་ནི་རབ་ཕྱེ་བ།
en: The rays of the sun fully open the face of the lotus.

source: བདེ་བ་ཆེན་པོ་གར་གྱིས་རབ་ཏུ་མཉེས་པར་མཛོད།
en: You have become aroused by the dance of great bliss.”
